In [6]:
import pandas as pd
import numpy as np

In [10]:
from numpy.random import randn
np.random.seed(101)

In [38]:
df = pd.DataFrame(np.random.randn(5, 4), index='A B C D E'.split(), columns='W X Y Z'.split())

In [13]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
df > 0 #teste de selecao (teste1)

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [15]:
bol = df > 0 #outra notacao (teste1.1)

In [17]:
bol

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [18]:
df[bol]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df[df['W']>0]  #selecionando valores maiores que W

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df[df['W']>0]['Y']  #selecionando os valores maiores que W na 
                    #coluna Y (teste2.1)

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [21]:
bol = df['W']>0    #selecionando os valores maiores que W e armazenando na var bol
df2 = df[bol]      #declarando meu DataFrame 2 (df2) e atribuindo o valor de bol a ele 
df2['Y']           #somente na coluna Y (teste2.1 Outra Notação)

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [22]:
df[df['W']>0) and (df['Y']>1)] #ocasionando erro AND != &  (teste3.1)

SyntaxError: closing parenthesis ')' does not match opening parenthesis '[' (<ipython-input-22-10cf889bb120>, line 1)

In [26]:
df[(df['W']>0)& (df['Y']>1)] #notação correta &  (teste3.2)

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df[(df['W']>0)|(df['Y']>1)]  #notação correta | (teste3.1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df.reset_index()  #volta a notação padrao de indice

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [29]:
df #veja que as alteração nao são salvar diretamente em nosso DataFrame(df)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df.reset_index(inplace = True) #utilizamos inplace para definir diretamente em nosso DataFrame(df)

In [41]:
col = 'RS RJ SP AM SC'.split()

In [42]:
col     #coluna criada

['RS', 'RJ', 'SP', 'AM', 'SC']

In [45]:
df['Estado'] = col    #vamos passar a coluna recem criada para o DataFrama(df)

In [46]:
df     #note que estado foi add

          W         X         Y         Z Estado
A  0.302665  1.693723 -1.706086 -1.159119     RS
B -0.134841  0.390528  0.166905  0.184502     RJ
C  0.807706  0.072960  0.638787  0.329646     SP
D -0.497104 -0.754070 -0.943406  0.484752     AM
E -0.116773  1.901755  0.238127  1.996652     SC

In [47]:
df.set_index('Estado')  #transformando Estado em nosso index
                        #vale ressaltar que essas alterações necessitam 
                        #do inplace para alterar diretamente em nosso Dataframe

               W         X         Y         Z
Estado
RS      0.302665  1.693723 -1.706086 -1.159119
RJ     -0.134841  0.390528  0.166905  0.184502
SP      0.807706  0.072960  0.638787  0.329646
AM     -0.497104 -0.754070 -0.943406  0.484752
SC     -0.116773  1.901755  0.238127  1.996652

In [48]:
df

          W         X         Y         Z Estado
A  0.302665  1.693723 -1.706086 -1.159119     RS
B -0.134841  0.390528  0.166905  0.184502     RJ
C  0.807706  0.072960  0.638787  0.329646     SP
D -0.497104 -0.754070 -0.943406  0.484752     AM
E -0.116773  1.901755  0.238127  1.996652     SC